blog-posts/2007-10-28-org-changing-the-task-states.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org: Changing the task states</title>
<!-- 2014-04-30 Wed 17:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Org: Changing the task states</h1>
<p>
October 28th, 2007 -
<a href="http://sachachua.com/blog/p/4425"><a href="http://sachachua.com/blog/p/4425">http://sachachua.com/blog/p/4425</a></a>
</p>

<p>
I find it useful to keep track of which tasks I've started. Adding the
 following line to the start of my Org file adds STARTED to my to-do
 status keywords.
</p>

<pre class="example">
#+SEQ_TODO: TODO(t) STARTED(s) WAITING(w) | DONE(d)
</pre>

<p>
Here's some code to make it easier to clock in and out of tasks:
</p>

<pre class="example">
(defun sacha/org-clock-in-if-starting ()
  "Clock in when the task is marked STARTED."
  (when (and (string= state "STARTED")
             (not (string= last-state state)))
    (org-clock-in)))
(add-hook 'org-after-todo-state-change-hook
      'sacha/org-clock-in-if-starting)
(defadvice org-clock-in (after sacha activate)
  "Set this task's status to 'STARTED'."
  (org-todo "STARTED"))
</pre>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/org">org</a>
</p>

<p>
Random Emacs symbol: isearch-update-ring &#x2013; Function: Add STRING to the
beginning of the search ring.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
